Revit 2024 API
MEPAnalyticalConnection.CanSupportAnalyticalConnection Method
 Checks if the connector can support the analytical connection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static bool CanSupportAnalyticalConnection(
	Connector connector
)
Visual Basic
Public Shared Function CanSupportAnalyticalConnection ( _
	connector As Connector _
) As Boolean
Visual C++
public:
static bool CanSupportAnalyticalConnection(
	Connector^ connector
)
Parameters
connector
Type: Autodesk.Revit.DB.Connector
 The testing connector.
Return Value
 True if the connector can support the network flow/pressure analysis, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPAnalyticalConnection Class
Autodesk.Revit.DB Namespace